---
kind: property
id: P:Autodesk.Revit.DB.AssemblyMemberDifferentType.TypeId1
source: html/e9afb7bd-c252-9a49-7cc6-af7567132242.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentType.TypeId1 Property

Type id of the first assembly member

## Syntax (C#)
```csharp
public ElementId TypeId1 { get; }
```